Zepto(function($){
    var oServicCon = $('#servicCon');
    var otherSerDetails = $('.otherSerDetails');
    var oWikiBtn = $('#wikiBtn');
    var oReturn2Con = $('#return2Con');
    var aWikiCon = $('.wikiCon li');
    var oNormalQ = $('.normalQ');

    oWikiBtn.on('click',function(){
        otherSerDetails.css('left',0);
        oServicCon.css('display','none');
    });
    oReturn2Con.on('click',function () {
        otherSerDetails.css('left','16rem');
        oServicCon.css('display','block');
    });

    // 获取问题函数
    var jsonQues={
        "0":[
            {"title":"出险以后该怎么办？","con":"一般保险公司都会要求在出险后48小时内报案，所以出险后一定要及时向保险公司报案，或者登陆本页面申请理赔。"},
            {"title":"如何绑定邀请码？","con":"进入服务页面，点击绑定邀请码进行绑定"},
            {"title":"什么叫“第三者”或“第三方”？","con":"“第三者”或“第三方”是指除保险人、被保险人之外的其他人"},
            {"title":"出险以后该怎么办？","con":"一般保险公司都会要求在出险后48小时内报案，所以出险后一定要及时向保险公司报案，或者登陆本页面申请理赔。"}
        ],
        "1":[
            {"title":"除了各渠道一致的理赔服务，网上投保还能享受到哪些增值特色服务？","con":"平安网上投保，提供平安各渠道一致的优质理赔服务，此外还提供各地增值特色服务点击了解"},
            {"title":"我的车在异地出险了，可以在出险当地理赔吗？","con":"在异地出险时无论在哪个城市购买的保险，在出险当地都能享受同投保地一样的查勘定损、领取赔款等优质理赔服务。"},
            {"title":"网上买车险，理赔是否和其他渠道一致？","con":"只要是平安的车险客户，都能享受平安各渠道一致的优质的理赔服务。与传统投保渠道相比，在平安官网买车险，其实只是提供了一个新的购买车险的渠道，后续的理赔服务仍然依赖于整个产险公司及各地分公司的服务保障体系。在这一点上，与传统的车险是没有任何区别的。"},
            {"title":"理赔报案电话是多少？","con":"可以为客户提供全天候全年无休假服务，受理各类业务报案、产险业务咨询、查勘调度、事故救援、客户投诉、电话销售、电话回访等温馨服务。"}
        ],
        "2":[
            {"title":"我每个月可以兑换多少礼品？","con":"由于礼品数量有限，我们对每位会员每个自然月获得礼品数设置了上限"},
            {"title":"为什么我兑换的时候会提示账号异常?","con":"为合理分配礼品，每个手机号或地址仅限一个折800账号使用，若发现多个账号使用相同手机号或收货地址换取礼品的会被自动取消订单，被扣除的积分不退，折800并有权视具体情形拉黑账号,账号拉黑后在兑换时会提示账号异常。"},
            {"title":"兑换之后可以修改地址、手机号码或者更换成其他商品吗","con":"请您在兑换前仔细核实好所有的信息，订单生成后将无法修改和调换。"},
            {"title":" 哪些积分行为是违规的？会有什么处罚措施?","con":"请大家通过正规合理的渠道获取积分，当发现用户通过机器、外挂、系统漏洞等非正常途径获取积分的，相应积分会被自动收回，兑换的礼品不予发放，情节严重者会被直接封号处理。"}
        ],
        "3":[
            {"title":"如果收到货出现问题应该如何处理?","con":"货物以图片和小编描述为主，兑换前请仔细查看，收货时请当面检查签收，若出现问题时（破损、货物出入较大等）可以告诉快递员原因，直接拒收，拒收后请及时联系在线客服告知相应的订单信息及拒收的原因，由客服人员来帮您对该订单作跟踪处理；签收后发现质量问题（签收验货时不能够当场判定的）请于签收当日联系客服提供截图核实，由于主客观原因太多，超过时限客服有权不再受理。"},
            {"title":"商品寄出后包裹被退回或丢失怎么办?","con":"请您在兑换前核实好相应的收件信息，订单发货后及时关注物流状态（默认使用圆通和中通快递），保持电话畅通，以便快递人员将商品顺利的送到您手中，若因为电话号码错误，停机，地址不详等因素造成快递的包裹被退回或者遗失，客服有权不受理。"},
            {"title":"什么叫“第三者”或“第三方”？","con":"“第三者”或“第三方”是指除保险人、被保险人之外的其他人"}
        ]
    };
    function wikiCon(index) {
        oNormalQ.html('');
        $.ajax({
            url:'data.json',
            type:'GET',
            dataType:'json',
            success:function (res) {
                var json={};
                if(res){
                    json=res[index];
                }else{
                    json=jsonQues[index];
                }
                $.each(json,function (i,v) {
                    $('<li class="con">\
                        <h4><em>Q</em>'+v.title+'</h4>\
                        <p>'+v.con+'</p>\
                    </li>').appendTo(oNormalQ);
                })
            },
            error:function () {
                console.log('连接失败')
            }
        })
    };
    wikiCon(0);
    aWikiCon.on('click',function () {
        var i=$(this).index();
        wikiCon(i);
        $('html, body').scrollTop(0);
        return false;
    })
});